[View in Colaboratory](https://colab.research.google.com/github/sdoro/notebook/blob/master/database.ipynb)

In [1]:
# Deletes sales sql database in case we need to start from scratch
#import os
#os.remove('Sales.db')

# rewrite/create a file
open('Sales.db', 'w')

In [0]:
import sqlite3

db_filename = 'Sales.db'
conn = sqlite3.connect(db_filename)

c = conn.cursor()

In [3]:
# costruzione db
c.execute('CREATE TABLE Bill (Cliente TEXT, Alloggio INTEGER, Cibo INTEGER, Bevande INTEGER)')

In [4]:
# popolamento
c.execute("INSERT INTO Bill (Cliente, Alloggio, Cibo) VALUES ('C35', 162, 75 )")
c.execute("INSERT INTO Bill (Cliente, Cibo, Bevande) VALUES ('C41', 38, 7 )")

c.execute('SELECT * FROM Bill')
print(c.fetchall())

[('C35', 162, 75, None), ('C41', None, 38, 7)]

In [5]:
# Costruzione db
cmd = 'CREATE TABLE Alloggi (Cliente TEXT, Costo INTEGER)'
c.execute(cmd)
cmd = 'CREATE TABLE Cibo (Cliente TEXT, Costo INTEGER)'
c.execute(cmd)
cmd = 'CREATE TABLE Bevande (Cliente TEXT, Costo INTEGER)'
c.execute(cmd)

In [6]:
# popolamento db
cmd ="INSERT INTO Alloggi (Cliente, Costo) VALUES ('C35', 162)"
c.execute(cmd)
c.execute('SELECT * FROM Alloggi')
print(c.fetchall())

cmd = "INSERT INTO Cibo (Cliente, Costo) VALUES ('C35', 75)"
c.execute(cmd)
cmd = "INSERT INTO Cibo (Cliente, Costo) VALUES ('C41', 38)"
c.execute(cmd)
c.execute('SELECT * FROM Cibo')
print(c.fetchall())

cmd = "INSERT INTO Bevande (Cliente, Costo) VALUES ('C41', 7)"
c.execute(cmd)
c.execute('SELECT * FROM Bevande')
print(c.fetchall())

[('C35', 162)]
[('C35', 75), ('C41', 38)]
[('C41', 7)]

In [7]:
# Costruzione db
cmd = 'CREATE TABLE Costi (Cliente TEXT, Categoria TEXT, Costo INTEGER)'
c.execute(cmd)

In [8]:
# popolamento db
co = [
  ('C35', 'Alloggio', 162),
  ('C35', 'Cibo', 75),
  ('C41', 'Cibo', 38),
  ('C41', 'Bevanda', 7)
]


c.executemany('INSERT INTO Costi VALUES (?,?,?)', co)
c.execute('SELECT * FROM Costi')
print(c.fetchall())

[('C35', 'Alloggio', 162), ('C35', 'Cibo', 75), ('C41', 'Cibo', 38), ('C41', 'Bevanda', 7)]

In [0]:
conn.commit()
conn.close()